In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  3.303927 -0.515697 -0.124978 -1.961043
2013-01-02  1.167725  0.135310  0.676714  1.143503
2013-01-03 -0.943461 -0.004036  0.157194  1.270921
2013-01-04 -0.242358 -1.070472  0.421939  0.098805
2013-01-05 -0.343166  0.997174 -0.288047  0.457141
2013-01-06 -0.457517  1.582179  0.018349  0.530828

In [5]:
df2 =pd.DataFrame({'A': 1.,
                  'B': pd.Timestamp('20130102'),
                  'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                  'D': np.array([3] * 4, dtype='int32'),
                  'E': pd.Categorical(["test", "train", "test", "train"]),
                  'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.to_numpy()

array([[ 3.30392718, -0.51569656, -0.12497782, -1.96104317],
       [ 1.16772511,  0.13531041,  0.67671397,  1.14350255],
       [-0.94346131, -0.00403562,  0.1571943 ,  1.27092077],
       [-0.24235825, -1.0704716 ,  0.42193903,  0.09880499],
       [-0.34316578,  0.99717446, -0.28804678,  0.45714082],
       [-0.45751698,  1.58217939,  0.01834922,  0.53082773]])

In [10]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.414192  0.187410  0.143529  0.256692
std    1.582791  0.971297  0.356654  1.172493
min   -0.943461 -1.070472 -0.288047 -1.961043
25%   -0.428929 -0.387781 -0.089146  0.188389
50%   -0.292762  0.065637  0.087772  0.493984
75%    0.815204  0.781708  0.355753  0.990334
max    3.303927  1.582179  0.676714  1.270921

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    3.303927    1.167725   -0.943461   -0.242358   -0.343166   -0.457517
B   -0.515697    0.135310   -0.004036   -1.070472    0.997174    1.582179
C   -0.124978    0.676714    0.157194    0.421939   -0.288047    0.018349
D   -1.961043    1.143503    1.270921    0.098805    0.457141    0.530828

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.961043 -0.124978 -0.515697  3.303927
2013-01-02  1.143503  0.676714  0.135310  1.167725
2013-01-03  1.270921  0.157194 -0.004036 -0.943461
2013-01-04  0.098805  0.421939 -1.070472 -0.242358
2013-01-05  0.457141 -0.288047  0.997174 -0.343166
2013-01-06  0.530828  0.018349  1.582179 -0.457517

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.242358 -1.070472  0.421939  0.098805
2013-01-01  3.303927 -0.515697 -0.124978 -1.961043
2013-01-03 -0.943461 -0.004036  0.157194  1.270921
2013-01-02  1.167725  0.135310  0.676714  1.143503
2013-01-05 -0.343166  0.997174 -0.288047  0.457141
2013-01-06 -0.457517  1.582179  0.018349  0.530828

In [17]:
df['A']

2013-01-01    3.303927
2013-01-02    1.167725
2013-01-03   -0.943461
2013-01-04   -0.242358
2013-01-05   -0.343166
2013-01-06   -0.457517
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  3.303927 -0.515697 -0.124978 -1.961043
2013-01-02  1.167725  0.135310  0.676714  1.143503
2013-01-03 -0.943461 -0.004036  0.157194  1.270921

In [19]:
df[1:2]

                   A        B         C         D
2013-01-02  1.167725  0.13531  0.676714  1.143503

## Selection by label

In [22]:
df.loc[dates[0]]

A    3.303927
B   -0.515697
C   -0.124978
D   -1.961043
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  3.303927 -0.515697
2013-01-02  1.167725  0.135310
2013-01-03 -0.943461 -0.004036
2013-01-04 -0.242358 -1.070472
2013-01-05 -0.343166  0.997174
2013-01-06 -0.457517  1.582179

In [24]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.167725  0.135310
2013-01-03 -0.943461 -0.004036
2013-01-04 -0.242358 -1.070472

In [25]:
df.loc['20130102', ['A', 'B']]

A    1.167725
B    0.135310
Name: 2013-01-02 00:00:00, dtype: float64

In [26]:
df.loc[dates[0], 'A']

3.3039271829780823

In [27]:
df.at[dates[0], 'A']

3.3039271829780823

## Selection by position

In [28]:
df.iloc[3]

A   -0.242358
B   -1.070472
C    0.421939
D    0.098805
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
# row, column
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.242358 -1.070472
2013-01-05 -0.343166  0.997174

In [30]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.167725  0.676714
2013-01-03 -0.943461  0.157194
2013-01-05 -0.343166 -0.288047

In [31]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.167725  0.135310  0.676714  1.143503
2013-01-03 -0.943461 -0.004036  0.157194  1.270921

In [32]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.515697 -0.124978
2013-01-02  0.135310  0.676714
2013-01-03 -0.004036  0.157194
2013-01-04 -1.070472  0.421939
2013-01-05  0.997174 -0.288047
2013-01-06  1.582179  0.018349

In [33]:
df.iloc[1, 1]

0.13531040716677975

In [34]:
df.iat[1, 1]

0.13531040716677975

## Boolean indexing (filtering?)

In [35]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  3.303927 -0.515697 -0.124978 -1.961043
2013-01-02  1.167725  0.135310  0.676714  1.143503

In [36]:
df[df > 0]

                   A         B         C         D
2013-01-01  3.303927       NaN       NaN       NaN
2013-01-02  1.167725  0.135310  0.676714  1.143503
2013-01-03       NaN       NaN  0.157194  1.270921
2013-01-04       NaN       NaN  0.421939  0.098805
2013-01-05       NaN  0.997174       NaN  0.457141
2013-01-06       NaN  1.582179  0.018349  0.530828

In [37]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  3.303927 -0.515697 -0.124978 -1.961043    one
2013-01-02  1.167725  0.135310  0.676714  1.143503    one
2013-01-03 -0.943461 -0.004036  0.157194  1.270921    two
2013-01-04 -0.242358 -1.070472  0.421939  0.098805  three
2013-01-05 -0.343166  0.997174 -0.288047  0.457141   four
2013-01-06 -0.457517  1.582179  0.018349  0.530828  three

In [39]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.943461 -0.004036  0.157194  1.270921   two
2013-01-05 -0.343166  0.997174 -0.288047  0.457141  four

## Setting

In [41]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [44]:
# Adds column F from indexed series, which adds the values to appropriate indexes
df['F'] = s1

In [45]:
# value of row 0, column A (0) = 0
df.at[dates[0], 'A'] = 0

In [46]:
# value of row 0, column 1 (B) = 0
df.iat[0, 1] = 0

In [47]:
# fills all rows ([:]) in column D with 5
df.loc[:, 'D'] = np.array([5] * len(df))

In [48]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.124978  5  NaN
2013-01-02  1.167725  0.135310  0.676714  5  1.0
2013-01-03 -0.943461 -0.004036  0.157194  5  2.0
2013-01-04 -0.242358 -1.070472  0.421939  5  3.0
2013-01-05 -0.343166  0.997174 -0.288047  5  4.0
2013-01-06 -0.457517  1.582179  0.018349  5  5.0

In [49]:
# Where operation - set negative where value > 0
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.124978 -5  NaN
2013-01-02 -1.167725 -0.135310 -0.676714 -5 -1.0
2013-01-03 -0.943461 -0.004036 -0.157194 -5 -2.0
2013-01-04 -0.242358 -1.070472 -0.421939 -5 -3.0
2013-01-05 -0.343166 -0.997174 -0.288047 -5 -4.0
2013-01-06 -0.457517 -1.582179 -0.018349 -5 -5.0

## Missing data

In [52]:
# creates new dataframe with rows 0-4 and all colums + a column E
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
# for indexes 0 - 1 and values in column E = 1
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.124978  5  NaN  1.0
2013-01-02  1.167725  0.135310  0.676714  5  1.0  1.0
2013-01-03 -0.943461 -0.004036  0.157194  5  2.0  NaN
2013-01-04 -0.242358 -1.070472  0.421939  5  3.0  NaN

In [54]:
# Drop rows with missing data
df1.dropna(how='any')

                   A        B         C  D    F    E
2013-01-02  1.167725  0.13531  0.676714  5  1.0  1.0

In [55]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.124978  5  5.0  1.0
2013-01-02  1.167725  0.135310  0.676714  5  1.0  1.0
2013-01-03 -0.943461 -0.004036  0.157194  5  2.0  5.0
2013-01-04 -0.242358 -1.070472  0.421939  5  3.0  5.0

In [56]:
# Get boolean mask for NaN values
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [58]:
# operations. defaulr groups by columns
df.mean()

A   -0.136463
B    0.273360
C    0.143529
D    5.000000
F    3.000000
dtype: float64

In [59]:
# other axis (groups by rows)
df.mean(1)

2013-01-01    1.218756
2013-01-02    1.595950
2013-01-03    1.241939
2013-01-04    1.421822
2013-01-05    1.873192
2013-01-06    2.228602
Freq: D, dtype: float64

## Histogram

In [60]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    0
2    3
3    2
4    4
5    1
6    1
7    1
8    1
9    4
dtype: int64

In [61]:
s.value_counts()

1    4
4    2
5    1
3    1
2    1
0    1
dtype: int64